# First print your name in the cell below then save this file. (or something nice about your instructor)

In [50]:
# In this cell print your name 
print('Yousuf Ahmed')

Yousuf Ahmed

# Data wrangling with Pandas exercise
* For this exercise we will be using the `listings.csv` data file.

In [51]:
import pandas as pd
import numpy as np

# Load in the data file using `pd.read_csv()`

In [52]:
# Load data here
df = pd.read_csv('../data/listings.csv')

## Exercise 2 - Filtering

Return the following subsets of the dataframe.

1. How many listings are there with a price less than 100? 


2. Find how many listings there are in just Brooklyn.


3. Find how many listings there are in Brooklyn with a price less than 100.


4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.


5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  The prices for all other listings should be the same as the were before. 


6. What % of the rooms are private, and what % of the rooms are shared.  
    * Hint, use `.value_counts()`

In [53]:
# 1. How many listings are there with a price less than 100? 

under100 = df['price'] < 100
print(f'There are {under100.sum()} listings under $100 out of a total of {len(df)}')

There are 22778 listings under $100 out of a total of 46527

In [54]:
# 2. Make a new DataFrame of listings in Brooklyn named `df_bk` 
# and find how many listings in just Brooklyn.

select_condition = df['neighbourhood_group'] == 'Brooklyn'
df_bk = df[select_condition ].copy()
print(f'There are {len(df_bk)} listings in Brooklyn out of a total of {len(df)}')

There are 18632 listings in Brooklyn out of a total of 46527

In [55]:
# 3. Find how many listings there are in Brooklyn with a price less than 100.

under100_bk = df_bk['price'] < 100
print(f'There are {under100_bk.sum()} listings in Brooklyn under $100 out of a total of {len(df_bk)}')

There are 10473 listings in Brooklyn under $100 out of a total of 18632

In [56]:
# 4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.
# How many total are there that have those names

hosts = ['Micael', 'David', 'John', 'Daniel']
select_statement = df['host_name'].isin(hosts)
df[select_statement]
print(f'There are {len(df_bk)} listings with the host name of Michael, David, John, and Daniel')

There are 18632 listings with the host name of Michael, David, John, and Daniel

In [57]:
# 5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  
# The prices for all other listings should be the same as the were before. 

df['adjusted_price'] = np.where(
    df['neighbourhood'] == 'Williamsburg',
    df['price'] + 100,
    df['price']
)
df[df['neighbourhood'] == 'Williamsburg'].head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,adjusted_price
11,6848,Only 2 stops to Manhattan studio,15991,Allen & Irina,Brooklyn,Williamsburg,40.70837,-73.95352,Entire home/apt,109,2,181,2020-03-16,1.32,1,0,209
15,7801,Sweet and Spacious Brooklyn Loft,21207,Chaya,Brooklyn,Williamsburg,40.71842,-73.95718,Entire home/apt,299,3,9,2011-12-28,0.07,1,337,399
35,14290,* ORIGINAL BROOKLYN LOFT *,56104,James,Brooklyn,Williamsburg,40.70420,-73.93560,Entire home/apt,131,3,95,2020-05-28,0.73,1,164,231
38,14377,Williamsburg 1 bedroom Apartment,56512,Joanna,Brooklyn,Williamsburg,40.70881,-73.95930,Entire home/apt,175,10,113,2020-01-24,0.87,1,165,275
42,15385,"Very, very cozy place",60252,Cristina,Brooklyn,Williamsburg,40.71185,-73.96204,Private room,80,7,49,2020-02-07,0.39,1,229,180

In [58]:
# 6. What % of the rooms are private, and what % of the rooms are shared.  

dfp = df['room_type'].value_counts(normalize=True) * 100
private = f'{dfp['Private room']:.2f}'
shared = f'{dfp['Shared room']:.2f}'
print(f'{private}% of the rooms are private and {shared}% are shared')

45.44% of the rooms are private and 2.12% are shared

# Exercise 3 - Grouping

1. Using `groupby`, count how many listings are in each neighbourhood_group.


2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 


3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 


4. Using `groupby`, find the median price for each room type in each neighbourhood_group.


5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices for each room type in each neighbourhood_group.

In [59]:
# 1. Using `groupby`, count how many listings are in each neighbourhood_group.

gb = df.groupby('neighbourhood_group')
print(gb.size())

neighbourhood_group
Bronx             1183
Brooklyn         18632
Manhattan        20580
Queens            5791
Staten Island      341
dtype: int64

In [60]:
# 2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 

gb['price'].mean()

neighbourhood_group
Bronx             92.751479
Brooklyn         120.225258
Manhattan        191.880466
Queens            99.754965
Staten Island    110.947214
Name: price, dtype: float64

In [61]:
# 2.5. Using `groupby`, find the mean price for each room_type. 

room_type_group = df.groupby('room_type')
room_type_group['price'].mean()

room_type
Entire home/apt    199.395950
Hotel room         275.015075
Private room        91.453084
Shared room         87.063830
Name: price, dtype: float64

In [62]:
# 3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 

gb['price'].agg(['min','max'])

                     min    max
neighbourhood_group
Bronx                 16   1404
Brooklyn               0  10000
Manhattan              0  10000
Queens                 0  10000
Staten Island         19   1200

In [63]:
# 4. Using `groupby`, find the mean price for each room_type in each neighbourhood_group.

hood_room_type = df.groupby(['neighbourhood_group','room_type'])
hood_room_type['price'].mean()

neighbourhood_group  room_type
Bronx                Entire home/apt    138.004819
                     Private room        68.419668
                     Shared room         66.391304
Brooklyn             Entire home/apt    171.587687
                     Hotel room         147.300000
                     Private room        71.291189
                     Shared room         57.870091
Manhattan            Entire home/apt    231.335572
                     Hotel room         292.515670
                     Private room       128.277069
                     Shared room        111.735084
Queens               Entire home/apt    150.168900
                     Hotel room         139.058824
                     Private room        69.972564
                     Shared room         89.891892
Staten Island        Entire home/apt    151.720930
                     Private room        70.312883
                     Shared room         46.000000
Name: price, dtype: float64

In [64]:
# 5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices 
# for each room type in each neighbourhood_group.

room_type_group['price'].agg( ['count', 'min', 'max', 'mean', 'median', 'std', 'sum'] )

                 count  min    max        mean  median         std      sum
room_type
Entire home/apt  23998    0  10000  199.395950   150.0  337.657116  4785104
Hotel room         398    0   2211  275.015075   192.0  301.658021   109456
Private room     21144   10  10000   91.453084    65.0  282.450148  1933684
Shared room        987   10  10000   87.063830    46.0  354.048373    85932

# Load, Merge, and Export files.
1. Load the `prices.csv` and the `n_listings.csv`
    * Having an error..? Inspect the actual csv file if you're having trouble

2. Do join that keeps all the records for each table.
    * Neighbourhood groups should include ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island',
       'LongIsland']

       
3. Save your joined csv as `joined.csv` into the data folder. 


4. Load your saved table and see if it looks the same or different that the DataFrame you used to create it.

In [65]:
# 1. Load the `prices.csv` and the `n_listings.csv`

dfprices = pd.read_csv('../data/prices.csv')
dfnlistings = pd.read_csv('../data/n_listings.csv', sep = ';')

In [66]:
# 2. Do join that keeps all the records for each table.

joined = pd.merge(dfnlistings, dfprices, how='outer', on='neighbourhood_group')
joined.head()

  neighbourhood_group  n_listings   mean_price
0               Bronx      1183.0    92.751479
1            Brooklyn     18632.0   120.225258
2          LongIsland      4121.0          NaN
3           Manhattan     20580.0   191.880466
4              Queens         NaN    99.754965

In [67]:
# 3. Save your joined csv as `joined.csv` into the data folder.
joined.to_csv('joined.csv', index=False)

In [68]:
# 4. Load your newly saved file, see if it looks the same.  If not, try saving with argument `index=False`
dfjoined= pd.read_csv('joined.csv')

dfjoined.head()

  neighbourhood_group  n_listings   mean_price
0               Bronx      1183.0    92.751479
1            Brooklyn     18632.0   120.225258
2          LongIsland      4121.0          NaN
3           Manhattan     20580.0   191.880466
4              Queens         NaN    99.754965

# Extra Credit
Every question below this cell is extra credit and optional.

### 1. (Easy) Explore this new PandasAI Package and tell me what its all about because I've never used it. 
* https://www.youtube.com/watch?v=5w6eZaoDVVk&ab_channel=CodingIsFun  
* See if you can use it on the listings.csv to find out some cool info. or answer some of the questions above. 


#### Answer:
 Pandas AI seems like a way to make data filtering and grouping easier by answering the question using the data in the dataframe, instead of coding each value/filter step by step. A con of this is that the AI does not return clean tables as manually searching by hand will do.
 ***

### 2. (Very Easy) Find other cool Panda packages / add ons and show us what they can do well. And how you installed them. 

#### Answer:
A cool Panda package I found was [Qgrid](https://github.com/quantopian/qgrid). It is a tool that introduces a custom grid that allows for a visual way to edit/filter dataframes, similarly to Excel, in Jupyter Notebooks. This gif from their GitHub shows how it works:

<img src="https://raw.githubusercontent.com/quantopian/qgrid/master/docs/images/filtering_demo.gif" alt="Filtering Demo" title="QGrid Filtering Demo" />

 ***

### 3. (Medium) Use the grammys.csv data for the next section of questions.

1. Who was won Album of the Year in 2016?


2. Who won Best Rap Album in 2009?


3. How many awards was Kendrick Lamar nomiated for, and how many did he win...?

In [69]:
#1. Who was won Album of the Year in 2016?
dfgrammys = pd.read_csv('../data/grammys.csv')
c1 = dfgrammys['year'] == 2016
c2 = dfgrammys['category'] == 'Album of the Year'
c3 = dfgrammys['winner'] == True
winner = dfgrammys[c1 & c2 & c3]
print(winner['workers'])

5505    Taylor Swift (artist/producer), Jack Antonoff ...
Name: workers, dtype: object

In [70]:
#2. Who won Best Rap Album in 2009?
c1 = dfgrammys['year'] == 2009
c2 = dfgrammys['category'] == 'Best Rap Album'
c3 = dfgrammys['winner'] == True
winner = dfgrammys[c1 & c2 & c3]
print(winner['workers'])

4396    Lil' Wayne
Name: workers, dtype: object

In [71]:
c1 = dfgrammys['workers'].str.contains('Kendrick Lamar', na=False)
c3 = dfgrammys['winner'] == True
nominations = len(dfgrammys[c1])
winners = len(dfgrammys[c1 & c3])
print(f'Kendrick Lamar was nominated for {nominations} Grammys and won {winners}.')

Kendrick Lamar was nominated for 20 Grammys and won 11.

### (Hard) Load the Game Logs for 2022 and add the column names using a dictionary.  
* [Link to the data page](https://www.retrosheet.org/gamelogs/)
* [Link to the column names](https://procatinator.com/)
* haha, gotta find them yourself!

### (Extra Hard) Download the files for the past 5 years into a new folder and add them all into one data frame using pandas, then save that new file.
* Try to not hard code in the file names. We want to do this programmatically because what if we want to add new/more file names in the future.